# THIS FILE IS AUTOMATICALLY GENERATED
# Project: \\Mac\Home\Desktop\Elektronik ingenioer\3rd semester\PRJ3\PRJ3\afstandssensor_test\UltraSonic_059_190702.cydsn\UltraSonic_059_190702.cyprj
# Date: Mon, 28 Apr 2025 16:30:52 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333332 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 41.666666666666664 -waveform {0 20.8333333333333} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {Clock_24MHz} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {UART_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 27 53} [list [get_pins {ClockBlock/dclk_glb_1}]]
create_clock -name {CyScBoostClk} -period 83.333333333333328 -waveform {0 41.6666666666667} [list [get_pins {ClockBlock/aclk_glb_0}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for \\Mac\Home\Desktop\Elektronik ingenioer\3rd semester\PRJ3\PRJ3\afstandssensor_test\UltraSonic_059_190702.cydsn\TopDesign\TopDesign.cysch
# Project: \\Mac\Home\Desktop\Elektronik ingenioer\3rd semester\PRJ3\PRJ3\afstandssensor_test\UltraSonic_059_190702.cydsn\UltraSonic_059_190702.cyprj
# Date: Mon, 28 Apr 2025 16:30:39 GMT
